---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures.CouldNotCreateWallPart
source: html/20dbe3d9-b2d4-9fa7-2173-a05e2823cdaa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures.CouldNotCreateWallPart Property

Failed to create basic layer geometry. Probably a failure either to create the cutter or to intersect the cutter with the wall geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouldNotCreateWallPart { get; }
```